МедПредыМобильные/src/Enums/ПрофилиМобильногоПриложения/ПрофилиМобильногоПриложения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ПрофилиМобильногоПриложения</name>
  <enumValues>
    <name>Супервайзер</name>
  </enumValues>
  <enumValues>
    <name>МедПредставитель</name>
  </enumValues>
</mdclass:Enum>

МедПредыМобильные/src/Enums/ПериодыВыгрузкиВМобильноеПриложение/ПериодыВыгрузкиВМобильноеПриложение.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ПериодыВыгрузкиВМобильноеПриложение</name>
  <enumValues>
    <name>ЗаПоследнийКвартал</name>
  </enumValues>
  <enumValues>
    <name>ЗаПоследнийМесяц</name>
  </enumValues>
  <enumValues>
    <name>ЗаПоследнююНеделю</name>
  </enumValues>
  <enumValues>
    <name>ЗаПоследнийДень</name>
  </enumValues>
  <enumValues>
    <name>ЗаВсеВремя</name>
  </enumValues>
</mdclass:Enum>

МедПредыМобильные/src/Documents/Визит/Визит.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Визит</name>
  <basedOn>Catalog.Контрагенты</basedOn>
  <attributes>
    <name>Операция</name>
    <type>
      <types>EnumRef.ПрофилиМобильногоПриложения</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидВизита</name>
    <type>
      <types>EnumRef.ВидыВизитов</types>
    </type>
  </attributes>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтактноеЛицо</name>
    <type>
      <types>CatalogRef.КонтактныеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>СостояниеВизита</name>
    <type>
      <types>EnumRef.СостоянияВизитов</types>
    </type>
  </attributes>
  <attributes>
    <name>ИзЦентральнойБазы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ГеоМеткаНачало</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачало</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ГеоМеткаОкончание</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончание</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Оценка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Картинка</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ЧекЛист</name>
    <attributes>
      <name>Пункт</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипЗначения</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>6</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Препараты</name>
    <attributes>
      <name>Товар</name>
      <type>
        <types>CatalogRef.Товары</types>
      </type>
    </attributes>
    <attributes>
      <name>Матрица</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Наличие</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Заказ</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Цены</name>
    <attributes>
      <name>Товар</name>
      <type>
        <types>CatalogRef.Товары</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

МедПредыМобильные/src/CommonModules/ОбновлениеИнформационнойБазыПереопределяемый/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// МОДУЛЬ СОДЕРЖИТ ОБЩИЕ МЕТОДЫ РАБОТЫ С БД
// - установка параметров сеанса
// - установка шрифтов и размеров элементов форм
// - обработка запуска приложения
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныйПрограммныйИнтерфейс

// Выполняет необходимые действия перед запуском приложения.
//
Процедура ОбновитьПриложение() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	ВерсияПриложенияДоОбновления = Константы.ТекущаяВерсияПриложения.Получить();
	НоваяВерсияПриложения = Метаданные.Версия;
	Если НЕ ЗначениеЗаполнено(ВерсияПриложенияДоОбновления) Тогда
		ПервыйЗапуск();
	КонецЕсли;
	Если ВерсияПриложенияДоОбновления <> НоваяВерсияПриложения Тогда
		Если ОбщегоНазначенияКлиентСервер.СравнитьВерсии("1.0.1.1", ВерсияПриложенияДоОбновления) > 0 Тогда
		КонецЕсли;
		Если ОбщегоНазначенияКлиентСервер.СравнитьВерсии("1.0.1.37", ВерсияПриложенияДоОбновления) > 0 Тогда
		КонецЕсли;
		Если ОбщегоНазначенияКлиентСервер.СравнитьВерсии("1.0.1.38", ВерсияПриложенияДоОбновления) > 0 Тогда
			// для оптимизации визуализации визитов введен новый реквизит, заполняем его
			Счетчик = 0;
			Визиты = Документы.Визит.Выбрать();
			Пока Визиты.Следующий() Цикл
				Если НЕ ЗначениеЗаполнено(Визиты.Операция) Тогда
					ОбъектВизита = Визиты.ПолучитьОбъект();
					ОбъектВизита.Операция = ?(ЗначениеЗаполнено(ОбъектВизита.Оценка),
												Перечисления.ПрофилиМобильногоПриложения.Супервайзер,
												Перечисления.ПрофилиМобильногоПриложения.Супервайзер);
					ОбъектВизита.Записать();
					Счетчик=Счетчик+1;
				КонецЕсли;
			КонецЦикла;
			Сообщить("Выполнено обновление на версию "+"1.0.1.38"+Символы.ПС+
					 "Обновлено "+Формат(Счетчик) + " визитов.");
		КонецЕсли;
		Если ОбщегоНазначенияКлиентСервер.СравнитьВерсии("1.0.1.38", ВерсияПриложенияДоОбновления) > 0 Тогда
			// установим период выгрузки месяц
			Константы.ПериодЗагрузки.Установить(Перечисления.ПериодыВыгрузкиВМобильноеПриложение.ЗаПоследнийМесяц);
			// для оптимизации быстродействия будут удалены данные визитов и мероприятий прошлого месяца
			Счетчик = 0;
			Визиты = Документы.Визит.Выбрать();
			Пока Визиты.Следующий() Цикл
				Если НЕ ЗначениеЗаполнено(Визиты.Операция) Тогда
					ОбъектВизита = Визиты.ПолучитьОбъект();
					ОбъектВизита.Операция = ?(ЗначениеЗаполнено(ОбъектВизита.Оценка),
												Перечисления.ПрофилиМобильногоПриложения.Супервайзер,
												Перечисления.ПрофилиМобильногоПриложения.Супервайзер);
					ОбъектВизита.Записать();
					Счетчик=Счетчик+1;
				КонецЕсли;
			КонецЦикла;
			Сообщить("Выполнено обновление на версию "+"1.0.1.38"+Символы.ПС+
					 "Обновлено "+Формат(Счетчик) + " визитов.");
		КонецЕсли;
		Константы.ТекущаяВерсияПриложения.Установить(НоваяВерсияПриложения);
	КонецЕсли;
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры // ОбновитьПриложение()

#КонецОбласти

#Область ОбработчикиОбновления

Процедура ПервыйЗапуск()
		
КонецПроцедуры

//Процедура ЗаполнитьЗначенияКонстантРежимаРаботы()
//	
//	Попытка
//		
//		ЕстьДанныеВБазе = Ложь;
//		
//		ВыборкаПлановОбмена = ПланыОбмена.МобильноеПриложение.Выбрать();
//		ВыборкаПлановОбмена.Следующий();
//		Если ВыборкаПлановОбмена.Следующий() Тогда
//			Если ЗначениеЗаполнено(Константы.АдресЦентральнойБазы.Получить()) Тогда
//				Константы.СоединениеСЦБУстановлено.Установить(Истина);
//			КонецЕсли;
//			ЕстьДанныеВБазе = Истина;
//		КонецЕсли;
//		
//		Если Константы.ИспользоватьСинхронизациюДанных.Получить() Тогда
//			ЕстьДанныеВБазе = Истина;
//		КонецЕсли;
//		
//		Если НЕ ЕстьДанныеВБазе Тогда
//			ВыборкаОбъектов = Справочники.Контрагенты.Выбрать();
//			Если ВыборкаОбъектов.Следующий() Тогда
//				ЕстьДанныеВБазе = Истина;
//			КонецЕсли;
//		КонецЕсли;
//		
//		Если НЕ ЕстьДанныеВБазе Тогда
//			ВыборкаОбъектов = Справочники.Статьи.Выбрать();
//			ВыборкаОбъектов.Следующий();
//			ВыборкаОбъектов.Следующий();
//			ВыборкаОбъектов.Следующий();
//			Если ВыборкаОбъектов.Следующий() Тогда
//				ЕстьДанныеВБазе = Истина;
//			КонецЕсли;
//		КонецЕсли;
//		
//		Если НЕ ЕстьДанныеВБазе Тогда
//			ВыборкаОбъектов = Справочники.Товары.Выбрать();
//			Если ВыборкаОбъектов.Следующий() Тогда
//				ЕстьДанныеВБазе = Истина;
//			КонецЕсли;
//		КонецЕсли;
//		
//		Если НЕ ЕстьДанныеВБазе Тогда
//			ВыборкаОбъектов = Документы.ВводОстатков.Выбрать();
//			Если ВыборкаОбъектов.Следующий() Тогда
//				ЕстьДанныеВБазе = Истина;
//			КонецЕсли;
//		КонецЕсли;
//		
//		Если НЕ ЕстьДанныеВБазе Тогда
//			ВыборкаОбъектов = Документы.Визит.Выбрать();
//			Если ВыборкаОбъектов.Следующий() Тогда
//				ЕстьДанныеВБазе = Истина;
//			КонецЕсли;
//		КонецЕсли;
//		
//		Если НЕ ЕстьДанныеВБазе Тогда
//			ВыборкаОбъектов = Документы.ПриходДенег.Выбрать();
//			Если ВыборкаОбъектов.Следующий() Тогда
//				ЕстьДанныеВБазе = Истина;
//			КонецЕсли;
//		КонецЕсли;
//		
//		Если НЕ ЕстьДанныеВБазе Тогда
//			ВыборкаОбъектов = Документы.ПриходТовара.Выбрать();
//			Если ВыборкаОбъектов.Следующий() Тогда
//				ЕстьДанныеВБазе = Истина;
//			КонецЕсли;
//		КонецЕсли;
//		
//		Если НЕ ЕстьДанныеВБазе Тогда
//			ВыборкаОбъектов = Документы.РасходДенег.Выбрать();
//			Если ВыборкаОбъектов.Следующий() Тогда
//				ЕстьДанныеВБазе = Истина;
//			КонецЕсли;
//		КонецЕсли;
//		
//		Если НЕ ЕстьДанныеВБазе Тогда
//			ВыборкаОбъектов = Документы.РасходТовара.Выбрать();
//			Если ВыборкаОбъектов.Следующий() Тогда
//				ЕстьДанныеВБазе = Истина;
//			КонецЕсли;
//		КонецЕсли;
//		
//		Если ЕстьДанныеВБазе Тогда
//			Константы.РежимРаботыВыбран.Установить(Истина);
//		КонецЕсли;
//	
//	Исключение
//	КонецПопытки;
//	
//КонецПроцедуры

//Процедура УстановитьКонстантуРежимРаботыПриложения()
//	
//	Попытка
//		Если Константы.ИспользоватьСинхронизациюДанных.Получить() Тогда
//			Константы.РежимРаботыПриложения.Установить(Перечисления.РежимыРаботыПриложения.Многопользовательский);
//		Иначе
//			Константы.РежимРаботыПриложения.Установить(Перечисления.РежимыРаботыПриложения.Автономный);
//		КонецЕсли;
//	Исключение
//	КонецПопытки;
//	
//КонецПроцедуры

#КонецОбласти
